// 角色数据列表
export const roles = [
    {
      id: 1,
      img: require("@/assets/explorer.jpg"),
      name: "飞贼波兹曼 | 专业人士",
      description: "古怪、另类、混乱，这些词语都能很好地描述这位专业人士，身兼保险箱窃贼与技术大脑于一体。当她没有嘟囔那些关于利润最大化悖论中存在的错误假设时，她还算是效率最高的五个“道德有问题”的“筹款专家”之一。她喜欢在人行道上散步，喜欢捆电缆的声音，喜欢在高强度压力下测试爆炸试验品。 别浪费时间，赶快引爆炸弹，好吗！我们就想要这么干！",
    },
    {
      id: 2,
      img: require("@/assets/explorer (2).jpg"),
      name: "残酷的达里尔爵士（迈阿密）| 专业人士",
      description: "这位臭名昭著的打劫团伙“专业人士”的领导者，傲慢、聪明又极其冷漠，特别是在对他人的痛苦方面。他自称自己只是一个喜欢在周末给当地武装税务人员找乐子的家伙。他对面临的任何问题都嗤之以鼻，不管那个问题有多么严重，即使这意味着他在火拼后孤身一人，身体被打成筛子，或炸开保险箱的时间只剩几秒，他也完全不在乎。 这个白色冰球面具和花衬衫是他恶人生涯中最爱的装扮。 梳个大背头，带个太阳镜",
    },
    {
      id: 3,
      img: require("@/assets/explorer (3).jpg"),
      name: "出逃的萨莉 | 专业人士",
      description: "出逃的萨莉是“专业人士”组织里执行机密行动的不二选择，她小到可以藏在任何地方，但声音大到可以唬住任何敌人。她是天才的混乱处理专员，无论多么糟糕的抢劫或劫持情况，她都能借助自己的应变能力，迅速而从容的扭转乾坤。 我又跳出来了, 我又进来了! 打我啊！",
    },
    {
      id: 4,
      img: require("@/assets/explorer (4).jpg"),
      name: "老K | 专业人士",
      description: "在“财务获取专家”工作申请表上，老K在任何需要填数字的地方，都只是简单的写上字母K。没人知道这代表什么。尽管如此，老K的手枪水平令他完全胜任这个职位。他非常强调自己的隐私——甚至没有任何一个同事看过他的脸——这使他成为最令人闻风丧胆的“专业人士”之一。 别把我们算在内。咱说走就走。",
    },
    {
      id: 5,
      img: require("@/assets/explorer (5).jpg"),
      name: "精锐捕兽者索尔曼 | 游击队",
      description: "炎热夏天的一天，在加勒比海上的郊外海岛，索尔曼正享受着一次奢华的短途度假旅行，这时，他被臭名昭著的游击队挟持为人质。索尔曼无意中偷听到这帮劫持者在讨论如何分赃，于是，他同这帮人协商达成一致，若能在24小时内再交付三名人质，那么他则可以重获自由。他做到了，他啥都没有借助，他唯一拥有的就只有金钱、魅力、以及如何跟世界上最可怕的邪教首领们沟通的技巧。游击队员们震惊于索尔曼那种对于同伴也毫无同情心的人格以及他能够提供稳定“赎金单位”（即“人质”）的能力，队员们为他在游击队中觅得了一个位置。索尔曼成为了游击队内获得人质赎金比例最高的人，这场游戏在开始之前就没有悬念了。 解决困局仅需三件东西：金钱、魅力和上膛的武器。",
    },
    {
      id: 6,
      img: require("@/assets/explorer (6).jpg"),
      name: "指挥官弗兰克·巴鲁德（湿袜） | 海豹蛙人",
      description: "指挥官弗兰克·巴鲁德起先在甲板作业，之后被派到水下执行任务，是第三代海豹突击队员，也是继“护目镜”费尔南德斯指挥官后第二位获得海军十字勋章的战斗潜水员。他经常被派往解决最为复杂的水下和地面任务。例如潜到美国使馆下方被水淹没的复杂洞穴线路中拆除爆炸装置。巴鲁德觉得这一切都归因于自己对于细节的执念。毕竟，当你决定把命交给你身上那套装备的时候，一个微小的失误都可能要命。然而同时，这个特质也让他对于自己的潜水伙伴来讲有点扫兴，所以身边伙伴为他起了个绰号“湿袜”。 一次检查，两次检查，三次检查……无限次检查。",
    },
    {
      id: 7,
      img: require("@/assets/explorer (7).jpg"),
      name: "残酷的达里尔爵士（聒噪）| 专业人士",
      description: "这位臭名昭著的打劫团伙“专业人士”的领导者，傲慢、聪明又极其冷漠，特别是在对他人的痛苦方面。他自称自己只是一个喜欢在周末给当地武装税务人员找乐子的家伙。他对面临的任何问题都嗤之以鼻，不管那个问题有多么严重，即使这意味着他在火拼后孤身一人，身体被打成筛子，或炸开保险箱的时间只剩几秒，他也完全不在乎。 这个带有小丑妆风格的面具，非常适合装扮起来，从那些娇气的富贵宝宝们手里抢走糖果。 人生远看是喜剧,近看是悲剧。",
    },
    {
      id: 8,
      img: require("@/assets/explorer (8).jpg"),
      name: "准备就绪的列赞 | 军刀",
      description: "作为一名专业掷弹兵，列赞是军刀组织任命的行动领袖。 当事情脱离列赞掌控时，他的暴脾气就显露无疑，其他人给他取了一个外号，“涨红了脸”的列赞。绝对不要当面喊他这个外号。 我骄傲，我自豪。",
    }
  ]

// 模拟异步数据获取
export default {
  getRoles(callback) {
    setTimeout(() => callback(roles), 100)
  }
}